using UnityEngine;

public static class RandomNaming
{
    public static string GetName()
    {
        var firstName = Random.Range(0, _bloods.Length);
        var secondName = Random.Range(0, _names.Length);
        return $"{_bloods[firstName]} {_names[secondName]}";
    }

    private static readonly string[] _bloods = new string[]
    {
        "사토", "스즈키", "다카하시", "다나카", "와타나베", "이토", "코바야시", "야마모토", "나카무라", "사이토",
        "카토", "야마다", "요시다", "사사키", "야마구치", "이노우에", "마츠모토", "키무라", "시미즈", "하야시",
        "야마자키", "이케다", "나카지마", "모리", "이시카와", "하시모토", "오가와", "아베", "이시이", "하세카와",
        "우치다", "오카다", "아오키", "콘도", "카네코", "와다", "오오타", "코지마", "시마다", "엔도", 
        "타무라", "타카기", "나카노", "코야마", "노다", "후쿠다", "오오츠카", "오카모토", "츠지", "요코야마",
        "고토", "마에다", "후지", "하라", "미우라", "오노", "카타야마", "요시무라", "우에노", "미야모토",
        "요코타", "니시카와", "타케다", "나카가와", "키타무라", "오오노", "타케우치", "하라다", "마츠오", "아노",
        "무라카미", "안도", "니시무라", "세키", "키쿠치", "모리타", "우에다", "노무라", "타나베", "이시다",
        "나카야마", "마츠다", "마루야마", "히로세", "야마시타", "쿠보", "마츠무라", "아라이", "카와카미", "오오시마",
        "노구치", "후쿠시마", "쿠로다", "마스다", "이마이", "사쿠라이", "아시하라", "핫토리", "후지와라", "이치카와",
        "토키노", "사쿠라", "호시마치", "아카이", "시라카미", "나츠이로", "미나토", "무라사키", "나마리", "유즈키",
        "오오조라", "오오카미", "네코마타", "이누가미", "우사다", "시라누이", "시로가네", "호쇼", "아마네", "츠노마키",
        "토코야미", "히메모리", "유키히나", "모모스즈", "시시로", "오마루", "와카네", "하쿠이", "사카마타", "카자마",
        "히오도시", "오토노세", "이치죠", "토도로키",

    };

    private static readonly string[] _names = new string[]
    {
        "아오카", "아오미", "아키히사", "아츠", "아사히", "아스카", "아스나", "아스네", "아야", "아야노", "아야메", "아라타", "아쿠아", "아야메", "아오",
        "안즈", "안나",
        "이츠키", "이나", "이로하",
        "우나", "우미",
        "에나미", "에리", "에렌",
        "오카유",
        "카오리", "카즈무네", "카즈하루", "카즈호", "카즈호시", "카즈유키", "카츠키", "카나에", "카나메", "카논", "카호", "카나타", "카나데",
        "칸나",
        "키누", "키유키", "키요시", "키요토",
        "쿠가", "쿠루미",
        "케이", "케이코", "케이고", "케이나",
        "코우", "코코에", "코코로", "코토네", "코나츠", "코유키", "코로네",  "코요리",
        "쿄우카",
        "사아야", "사이", "사이카", "사오리", "사키", "사쿠", "사야", "사야카", "사유",  "사쿠라",
        "시오리", "시즈쿠", "시노부", "시온",
        "신리", 
        "슈우코", "치요코",
        "쇼우카", "소라",
        "스미레", "스이세이", "스바루",
        "세이카", "세츠카", "세츠나", 
        "센카", 
        "치아키", "치카", "치사", "치즈루", "치토세", "치도리", "치나", "치나츠", "치하나", "치하야", "치히로", "치호", 
        "츠무기", 
        "테루미", 
        "토와",
        "나에코", "나오", "나기", "나기사", "나나미", 
        "노조미", 
        "하나", "하나네", "하나호", "하루카", "하지메",
        "히토카", "히나", "히나타", "히로코", "히로미", "히토리",
        "후쿠", "후츠키", "후미카", "후부키",
        "호마레", 
        "마키", "마야", "마리", "마츠리",
        "미카", "미키", "미쿠", "미소라", "미나카", "미나미", "미치코", "미츠키", "미하나", "미라이", "미레이", "미오",
        "메이", 
        "모이", "모에", "모에카", "모모카", 
        "유이", "유나", "유우", "유우나", "유카", "유키카", "유즈노", "유즈하", 
        "요시카", "요츠히", "요츠바", "요리카", 
        "라미",
        "란", "란코", 
        "리아", "리오", "리사", "리리카", 
        "루나",
        "레이코", "레이나", 
        "와카바", "와타메",
    };
}
